<a href="https://colab.research.google.com/github/anko191/Python_Kaggle/blob/master/pandas/pandas_data_preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [38]:
import pandas as pd
import numpy as np
df = pd.read_csv('/content/sample_pandas_normal.csv', index_col = 0)
df['sex'] = ['female', np.nan, 'male', 'male', 'female', 'male']
df['rank'] = [2,1,1,0,2,0]
print(df)

         age state  point     sex  rank
name
Alice     24    NY     64  female     2
Bob       42    CA     92     NaN     1
Charlie   18    CA     70    male     1
Dave      68    TX     70    male     0
Ellen     24    CA     88  female     2
Frank     30    NY     57    male     0

In [36]:
df = pd.get_dummies(df)
print(df)

         age  point  rank  state_CA  state_NY  state_TX  sex_female  sex_male
name
Alice     24     64     2         0         1         0           1         0
Bob       42     92     1         1         0         0           0         0
Charlie   18     70     1         1         0         0           0         1
Dave      68     70     0         0         0         1           0         1
Ellen     24     88     2         1         0         0           1         0
Frank     30     57     0         0         1         0           0         1

In [39]:
print(pd.get_dummies(df['sex']))
print(pd.get_dummies(['male', 1, 1, 2]))

         female  male
name
Alice         1     0
Bob           0     0
Charlie       0     1
Dave          0     1
Ellen         1     0
Frank         0     1
   1  2  male
0  0  0     1
1  1  0     0
2  1  0     0
3  0  1     0

In [40]:
print(pd.get_dummies(np.arange(6)))

   0  1  2  3  4  5
0  1  0  0  0  0  0
1  0  1  0  0  0  0
2  0  0  1  0  0  0
3  0  0  0  1  0  0
4  0  0  0  0  1  0
5  0  0  0  0  0  1

In [41]:
print(pd.get_dummies(df))

         age  point  rank  state_CA  state_NY  state_TX  sex_female  sex_male
name
Alice     24     64     2         0         1         0           1         0
Bob       42     92     1         1         0         0           0         0
Charlie   18     70     1         1         0         0           0         1
Dave      68     70     0         0         0         1           0         1
Ellen     24     88     2         1         0         0           1         0
Frank     30     57     0         0         1         0           0         1

In [42]:
print(pd.get_dummies(df, drop_first = True))

         age  point  rank  state_NY  state_TX  sex_male
name
Alice     24     64     2         1         0         0
Bob       42     92     1         0         0         0
Charlie   18     70     1         0         0         1
Dave      68     70     0         0         1         1
Ellen     24     88     2         0         0         0
Frank     30     57     0         1         0         1

In [43]:
print(pd.get_dummies(df, drop_first=True, dummy_na = True))

         age  point  rank  state_NY  state_TX  state_nan  sex_male  sex_nan
name
Alice     24     64     2         1         0          0         0        0
Bob       42     92     1         0         0          0         0        1
Charlie   18     70     1         0         0          0         1        0
Dave      68     70     0         0         1          0         1        0
Ellen     24     88     2         0         0          0         0        0
Frank     30     57     0         1         0          0         1        0

In [44]:
print(pd.get_dummies(df, drop_first=True, prefix='', prefix_sep=''))

         age  point  rank  NY  TX  male
name
Alice     24     64     2   1   0     0
Bob       42     92     1   0   0     0
Charlie   18     70     1   0   0     1
Dave      68     70     0   0   1     1
Ellen     24     88     2   0   0     0
Frank     30     57     0   1   0     1

In [45]:
print(pd.get_dummies(df, drop_first=True, prefix=['ST', 'sex'], prefix_sep='-'))

         age  point  rank  ST-NY  ST-TX  sex-male
name
Alice     24     64     2      1      0         0
Bob       42     92     1      0      0         0
Charlie   18     70     1      0      0         1
Dave      68     70     0      0      1         1
Ellen     24     88     2      0      0         0
Frank     30     57     0      1      0         1

In [46]:
print(pd.get_dummies(df, drop_first=True, prefix={'state':'ST', 'sex':'sex'}, prefix_sep = '-'))

         age  point  rank  ST-NY  ST-TX  sex-male
name
Alice     24     64     2      1      0         0
Bob       42     92     1      0      0         0
Charlie   18     70     1      0      0         1
Dave      68     70     0      0      1         1
Ellen     24     88     2      0      0         0
Frank     30     57     0      1      0         1

In [47]:
print(pd.get_dummies(df, drop_first=True, columns = ['sex', 'rank']))

         age state  point  sex_male  rank_1  rank_2
name
Alice     24    NY     64         0       0       1
Bob       42    CA     92         0       1       0
Charlie   18    CA     70         1       1       0
Dave      68    TX     70         1       0       0
Ellen     24    CA     88         0       0       1
Frank     30    NY     57         1       0       0

In [48]:
df['rank'] = df['rank'].astype(object)
print(pd.get_dummies(df, drop_first=True))

         age  point  state_NY  state_TX  sex_male  rank_1  rank_2
name
Alice     24     64         1         0         0       0       1
Bob       42     92         0         0         0       1       0
Charlie   18     70         0         0         1       1       0
Dave      68     70         0         1         1       0       0
Ellen     24     88         0         0         0       0       1
Frank     30     57         1         0         1       0       0

In [49]:
print(df['state'].map({'CA':0, 'NY':1, 'TX':2}))

name
Alice      1
Bob        0
Charlie    0
Dave       2
Ellen      0
Frank      1
Name: state, dtype: int64

In [50]:
df['state'] = df['state'].map({'CA':0, 'NY':1, 'TX':2})
print(df)

         age  state  point     sex rank
name
Alice     24      1     64  female    2
Bob       42      0     92     NaN    1
Charlie   18      0     70    male    1
Dave      68      2     70    male    0
Ellen     24      0     88  female    2
Frank     30      1     57    male    0

In [51]:
df

         age  state  point     sex rank
name
Alice     24      1     64  female    2
Bob       42      0     92     NaN    1
Charlie   18      0     70    male    1
Dave      68      2     70    male    0
Ellen     24      0     88  female    2
Frank     30      1     57    male    0

In [52]:
df = pd.read_csv('/content/sample_pandas_normal.csv', index_col = 0)
df_A, df_B = df[:3].copy(), df[3:].copy()
print(df_A)
print(df_B)

         age state  point
name
Alice     24    NY     64
Bob       42    CA     92
Charlie   18    CA     70
       age state  point
name
Dave    68    TX     70
Ellen   24    CA     88
Frank   30    NY     57

In [53]:
print(pd.get_dummies(df_A))
print(pd.get_dummies(df_B))

         age  point  state_CA  state_NY
name
Alice     24     64         0         1
Bob       42     92         1         0
Charlie   18     70         1         0
       age  point  state_CA  state_NY  state_TX
name
Dave    68     70         0         0         1
Ellen   24     88         1         0         0
Frank   30     57         0         1         0

In [54]:
categories = set(df_A['state'].unique().tolist() + df_B['state'].unique().tolist())
print(categories)

{'TX', 'CA', 'NY'}

In [56]:
df_A['state'] = pd.Categorical(df_A['state'], categories=categories)
print(df_A)

         age state  point
name
Alice     24    NY     64
Bob       42    CA     92
Charlie   18    CA     70

In [57]:
df

         age state  point
name
Alice     24    NY     64
Bob       42    CA     92
Charlie   18    CA     70
Dave      68    TX     70
Ellen     24    CA     88
Frank     30    NY     57

In [58]:
df_B['state'] = pd.Categorical(df_B['state'], categories=categories)

In [59]:
print(df_A['state'].dtypes)

category

In [60]:
print(pd.get_dummies(df_A))
print(pd.get_dummies(df_B))

         age  point  state_TX  state_CA  state_NY
name
Alice     24     64         0         0         1
Bob       42     92         0         1         0
Charlie   18     70         0         1         0
       age  point  state_TX  state_CA  state_NY
name
Dave    68     70         1         0         0
Ellen   24     88         0         1         0
Frank   30     57         0         0         1

In [63]:
df = pd.read_csv('/content/sample_pandas_normal.csv', index_col = 0)
df_train, df_test = df[:3].copy(), df[3:].copy()
categories = df_train['state'].unique()
df_train['state'] = pd.Categorical(df_train['state'], categories=categories)
df_test['state'] = pd.Categorical(df_test['state'], categories = categories)
print(df_test)

       age state  point
name
Dave    68   NaN     70
Ellen   24    CA     88
Frank   30    NY     57

In [64]:
print(pd.get_dummies(df_train))
print(pd.get_dummies(df_test))

         age  point  state_NY  state_CA
name
Alice     24     64         1         0
Bob       42     92         0         1
Charlie   18     70         0         1
       age  point  state_NY  state_CA
name
Dave    68     70         0         0
Ellen   24     88         0         1
Frank   30     57         1         0

In [65]:
df = pd.read_csv('/content/sample_pandas_normal.csv', index_col = 0)
df_train, df_test = df[:3].copy(), df[3:].copy()
cols = df_train.select_dtypes('object').columns
print(cols)

Index(['state'], dtype='object')

In [66]:
for col in cols:
    categories = df_train[col].unique()
    df_train[col] = pd.Categorical(df_train[col], categories = categories)
    df_test[col] = pd.Categorical(df_test[col], categories = categories)
df_train = pd.get_dummies(df_train)
df_test = pd.get_dummies(df_test)

In [67]:
print(df_train)

         age  point  state_NY  state_CA
name
Alice     24     64         1         0
Bob       42     92         0         1
Charlie   18     70         0         1

In [68]:
import pandas as pd
s = pd.Series(data = [x**2 for x in range(11)], index = list('abcdefghijk'))
print(s)

a      0
b      1
c      4
d      9
e     16
f     25
g     36
h     49
i     64
j     81
k    100
dtype: int64

In [69]:
s_cut = pd.cut(s, 4)
print(s_cut)

a     (-0.1, 25.0]
b     (-0.1, 25.0]
c     (-0.1, 25.0]
d     (-0.1, 25.0]
e     (-0.1, 25.0]
f     (-0.1, 25.0]
g     (25.0, 50.0]
h     (25.0, 50.0]
i     (50.0, 75.0]
j    (75.0, 100.0]
k    (75.0, 100.0]
dtype: category
Categories (4, interval[float64]): [(-0.1, 25.0] < (25.0, 50.0] < (50.0, 75.0] < (75.0, 100.0]]

In [70]:
print(pd.cut(s, [0,10,50,100]))

a              NaN
b      (0.0, 10.0]
c      (0.0, 10.0]
d      (0.0, 10.0]
e     (10.0, 50.0]
f     (10.0, 50.0]
g     (10.0, 50.0]
h     (10.0, 50.0]
i    (50.0, 100.0]
j    (50.0, 100.0]
k    (50.0, 100.0]
dtype: category
Categories (3, interval[int64]): [(0, 10] < (10, 50] < (50, 100]]

In [71]:
s_cut, bins = pd.cut(s, 4, retbins=True)
print(s_cut)

a     (-0.1, 25.0]
b     (-0.1, 25.0]
c     (-0.1, 25.0]
d     (-0.1, 25.0]
e     (-0.1, 25.0]
f     (-0.1, 25.0]
g     (25.0, 50.0]
h     (25.0, 50.0]
i     (50.0, 75.0]
j    (75.0, 100.0]
k    (75.0, 100.0]
dtype: category
Categories (4, interval[float64]): [(-0.1, 25.0] < (25.0, 50.0] < (50.0, 75.0] < (75.0, 100.0]]

In [72]:
print(bins)

[ -0.1  25.   50.   75.  100. ]

In [73]:
print(pd.cut(s, 4, right = False))

a      [0.0, 25.0)
b      [0.0, 25.0)
c      [0.0, 25.0)
d      [0.0, 25.0)
e      [0.0, 25.0)
f     [25.0, 50.0)
g     [25.0, 50.0)
h     [25.0, 50.0)
i     [50.0, 75.0)
j    [75.0, 100.1)
k    [75.0, 100.1)
dtype: category
Categories (4, interval[float64]): [[0.0, 25.0) < [25.0, 50.0) < [50.0, 75.0) < [75.0, 100.1)]

In [74]:
print(pd.cut(s, 4, labels = False))

a    0
b    0
c    0
d    0
e    0
f    0
g    1
h    1
i    2
j    3
k    3
dtype: int64

In [75]:
print(pd.cut(s, 4, labels = ['small', 'medium', 'large', 'x-large']))

a      small
b      small
c      small
d      small
e      small
f      small
g     medium
h     medium
i      large
j    x-large
k    x-large
dtype: category
Categories (4, object): [small < medium < large < x-large]

In [77]:
print(pd.cut(s,3))

a      (-0.1, 33.333]
b      (-0.1, 33.333]
c      (-0.1, 33.333]
d      (-0.1, 33.333]
e      (-0.1, 33.333]
f      (-0.1, 33.333]
g    (33.333, 66.667]
h    (33.333, 66.667]
i    (33.333, 66.667]
j     (66.667, 100.0]
k     (66.667, 100.0]
dtype: category
Categories (3, interval[float64]): [(-0.1, 33.333] < (33.333, 66.667] < (66.667, 100.0]]

In [80]:
print(pd.cut(s, 3, precision=1))

a     (-0.1, 33.3]
b     (-0.1, 33.3]
c     (-0.1, 33.3]
d     (-0.1, 33.3]
e     (-0.1, 33.3]
f     (-0.1, 33.3]
g     (33.3, 66.7]
h     (33.3, 66.7]
i     (33.3, 66.7]
j    (66.7, 100.0]
k    (66.7, 100.0]
dtype: category
Categories (3, interval[float64]): [(-0.1, 33.3] < (33.3, 66.7] < (66.7, 100.0]]

In [81]:
s_qcut, bins = pd.qcut(s, 4, labels=['Q1','Q2', 'Q3', 'Q4'], retbins = True)
print(s_qcut)
print(bins)

a    Q1
b    Q1
c    Q1
d    Q2
e    Q2
f    Q2
g    Q3
h    Q3
i    Q4
j    Q4
k    Q4
dtype: category
Categories (4, object): [Q1 < Q2 < Q3 < Q4]
[  0.    6.5  25.   56.5 100. ]

In [82]:
s_duplicate = pd.Series(data = [0,0,0,0,0,1,2,3,4,5,6], index = list('abcdefghijk'))

In [83]:
print(s_duplicate)

a    0
b    0
c    0
d    0
e    0
f    1
g    2
h    3
i    4
j    5
k    6
dtype: int64

In [84]:
print(pd.qcut(s_duplicate, 2))

a    (-0.001, 1.0]
b    (-0.001, 1.0]
c    (-0.001, 1.0]
d    (-0.001, 1.0]
e    (-0.001, 1.0]
f    (-0.001, 1.0]
g       (1.0, 6.0]
h       (1.0, 6.0]
i       (1.0, 6.0]
j       (1.0, 6.0]
k       (1.0, 6.0]
dtype: category
Categories (2, interval[float64]): [(-0.001, 1.0] < (1.0, 6.0]]

In [85]:
print(pd.qcut(s_duplicate,4,duplicates='drop'))

a    (-0.001, 1.0]
b    (-0.001, 1.0]
c    (-0.001, 1.0]
d    (-0.001, 1.0]
e    (-0.001, 1.0]
f    (-0.001, 1.0]
g       (1.0, 3.5]
h       (1.0, 3.5]
i       (3.5, 6.0]
j       (3.5, 6.0]
k       (3.5, 6.0]
dtype: category
Categories (3, interval[float64]): [(-0.001, 1.0] < (1.0, 3.5] < (3.5, 6.0]]

In [86]:
counts = pd.cut(s, 3, labels=['S', 'M', 'L']).value_counts()
print(counts)

S    6
M    3
L    2
dtype: int64

In [87]:
print(type(counts))

<class 'pandas.core.series.Series'>

In [88]:
print(counts['M'])

3

In [89]:
print(pd.value_counts(pd.cut(s,3,labels=['S', 'M', 'L'])))

S    6
M    3
L    2
dtype: int64

In [92]:
l = [x**2 for x in range(11)]
print(l)
l_cut = pd.cut(l, 3, labels = ['S', 'M','L'])
print(l_cut)

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100]
[S, S, S, S, S, ..., M, M, M, L, L]
Length: 11
Categories (3, object): [S < M < L]

In [93]:
print(list(l_cut))

['S', 'S', 'S', 'S', 'S', 'S', 'M', 'M', 'M', 'L', 'L']

In [94]:
print(pd.value_counts(l_cut))

S    6
M    3
L    2
dtype: int64

In [95]:
df_titanic = pd.read_csv('/content/titanic_train.csv').drop(['Name','Ticket', 'Cabin', 'Embarked'], axis = 1)
print(df_titanic.head())

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0            1         0       3    male  22.0      1      0   7.2500
1            2         1       1  female  38.0      1      0  71.2833
2            3         1       3  female  26.0      0      0   7.9250
3            4         1       1  female  35.0      1      0  53.1000
4            5         0       3    male  35.0      0      0   8.0500

In [96]:
print(df_titanic['Age'].describe())

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [97]:
print(pd.cut(df_titanic['Age'],  5, precision=0).value_counts(sort=False,dropna=False))

(0.0, 16.0]     100
(16.0, 32.0]    346
(32.0, 48.0]    188
(48.0, 64.0]     69
(64.0, 80.0]     11
NaN             177
Name: Age, dtype: int64

In [99]:
df_titanic['Age_bin'] = pd.cut(df_titanic['Age'], 5, labels = False)

In [100]:
print(df_titanic.head())

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare  Age_bin
0            1         0       3    male  22.0      1      0   7.2500      1.0
1            2         1       1  female  38.0      1      0  71.2833      2.0
2            3         1       3  female  26.0      0      0   7.9250      1.0
3            4         1       1  female  35.0      1      0  53.1000      2.0
4            5         0       3    male  35.0      0      0   8.0500      2.0